Tekla.Structures.Drawing.GridLine.GridLineAttributes
The GridLineAttributes class is the attributes class for the grid line.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.Font
The grid line's font attributes.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.Line
The grid line's line attributes.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.Frame
The frame attributes of the grid line's label.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.OffsetAtStartOfLine
The offset for the beginning of the grid line.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.OffsetAtEndOfLine
The offset for the end of the grid line.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.DrawTextAtStartOfGridLine
Set as true if you want to show the grid line's text label at the start of the line.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.DrawTextAtEndOfGridLine
Set as true if you want to show the grid line's text label at the end of the line.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.DrawOnlyTextLabelsNotGridLines
Set as true if you don't want to draw the grid lines, only show the grid lines' text labels.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.GridLine.GridLineAttributes.#ctor(System.Boolean)
Creates a new default grid line attributes instance that does not load standard attributes

Tekla.Structures.Drawing.GridLine.GridLineAttributes.#ctor
Creates a new default grid line attributes instance that loads standard attributes.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.#ctor(System.String)
Creates a new grid line attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.GridLine.GridLineAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.